index.org
* Intro
实现windows m-num切换进程。快速加载程序。
* User
* Dev
** DONE 如何linux cli shell设置快捷键调用脚本？
   CLOSED: [2017-08-10 Thu 17:50]
？快捷键调用wmctrl脚本。

#+BEGIN_SRC  

#+END_SRC
#+BEGIN_SRC
https://www.google.com/search?q=autohotkey+alternative+linux
https://autohotkey.com/boards/viewtopic.php?t=9806
xbindkeys
#+END_SRC

** 如何xbindkeys解决延迟问题？
？解决win-num需要按多次才能激活的问题
** DONE 如何xbindkeys查看按键符号或按键代码？
   CLOSED: [2017-08-10 Thu 18:57]
？实现windows m-num切换进程。快速加载程序。
#+BEGIN_SRC
https://www.google.com/search?q=xbindkeys+key+codes
https://wiki.archlinux.org/index.php/Xbindkeys
xbindkeys -k
#+END_SRC
** DONE 是否xbindkeys快捷键允许不用空格？
   CLOSED: [2017-08-10 Thu 18:51]
？避免多余排版。

#+BEGIN_SRC
"gnome-calculator" 
control+shift + q
#+END_SRC

不需要空格。
** DONE 如何xbindkeys调用脚本？
   CLOSED: [2017-08-10 Thu 18:24]
？快捷键调用wmctrl脚本。

#+BEGIN_SRC
man xbindkeys
xbindkeys --defaults > $HOME/.xbindkeysrc

"gnome-calculator" 
  control+shift + q
#+END_SRC

** DONE 如何xbindkeys转义命令中的双引号？
   CLOSED: [2017-08-10 Thu 18:24]
？解决命令中的变量替换问题。"n=1; wmctrl -l | sed -En "${n}p" | awk "{print $1}" | xargs -i wmctrl -ia {}"

#+BEGIN_SRC
https://www.google.com/search?q=xbindkeys+quote+escape
https://superuser.com/questions/400665/xbindkeys-escape-quotes
Technically what's happening is that xbindkeys removes the outermost pair of double quotes, then runs the remaining string using sh -c.
#+END_SRC
** DONE 如何wmctrl使用16进制窗口id激活进程？
   CLOSED: [2017-08-10 Thu 19:13]
？id精确激活进程。

#+BEGIN_SRC
man wmctrl
-i     Interpret window arguments (<WIN>) as a numeric value rather  than  a
              string  name  for  the  window.  If the numeric value starts with the
              prefix '0x' it is assumed to be a hexadecimal number.

wmctrl -ia $win_id
#+END_SRC
** 如何wmctrl -l不列出没有窗口的信息？
？解决幽灵窗口，例如virtualbox关掉管理窗口还是有管理窗口的信息。


