index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<!-- 2017-08-10 Thu 20:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yjr" />
</head>
<body>
<div id="content">
<h1 class="title">index</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Intro</a></li>
<li><a href="#sec-2">2. User</a></li>
<li><a href="#sec-3">3. Dev</a>
<ul>
<li><a href="#sec-3-1">3.1. <span class="done DONE">DONE</span> 如何linux cli shell设置快捷键调用脚本？</a></li>
<li><a href="#sec-3-2">3.2. 如何xbindkeys解决延迟问题？</a></li>
<li><a href="#sec-3-3">3.3. <span class="done DONE">DONE</span> 如何xbindkeys查看按键符号或按键代码？</a></li>
<li><a href="#sec-3-4">3.4. <span class="done DONE">DONE</span> 是否xbindkeys快捷键允许不用空格？</a></li>
<li><a href="#sec-3-5">3.5. <span class="done DONE">DONE</span> 如何xbindkeys调用脚本？</a></li>
<li><a href="#sec-3-6">3.6. <span class="done DONE">DONE</span> 如何xbindkeys转义命令中的双引号？</a></li>
<li><a href="#sec-3-7">3.7. <span class="done DONE">DONE</span> 如何wmctrl使用16进制窗口id激活进程？</a></li>
<li><a href="#sec-3-8">3.8. 如何wmctrl -l不列出没有窗口的信息？</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
实现windows m-num切换进程。快速加载程序。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> User</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Dev</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> 如何linux cli shell设置快捷键调用脚本？</h3>
<div class="outline-text-3" id="text-3-1">
<p>
？快捷键调用wmctrl脚本。
</p>

<p class="verse">
<a href="https://www.google.com/search?q=autohotkey+alternative+linux">https://www.google.com/search?q=autohotkey+alternative+linux</a><br  />
<a href="https://autohotkey.com/boards/viewtopic.php?t=9806">https://autohotkey.com/boards/viewtopic.php?t=9806</a><br  />
xbindkeys<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 如何xbindkeys解决延迟问题？</h3>
<div class="outline-text-3" id="text-3-2">
<p>
？解决win-num需要按多次才能激活的问题
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="done DONE">DONE</span> 如何xbindkeys查看按键符号或按键代码？</h3>
<div class="outline-text-3" id="text-3-3">
<p>
？实现windows m-num切换进程。快速加载程序。
</p>
<p class="verse">
<a href="https://www.google.com/search?q=xbindkeys+key+codes">https://www.google.com/search?q=xbindkeys+key+codes</a><br  />
<a href="https://wiki.archlinux.org/index.php/Xbindkeys">https://wiki.archlinux.org/index.php/Xbindkeys</a><br  />
xbindkeys -k<br  />
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="done DONE">DONE</span> 是否xbindkeys快捷键允许不用空格？</h3>
<div class="outline-text-3" id="text-3-4">
<p>
？避免多余排版。
</p>

<p class="verse">
"gnome-calculator"<br  />
control+shift + q<br  />
</p>

<p>
不需要空格。
</p>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> <span class="done DONE">DONE</span> 如何xbindkeys调用脚本？</h3>
<div class="outline-text-3" id="text-3-5">
<p>
？快捷键调用wmctrl脚本。
</p>

<p class="verse">
man xbindkeys<br  />
xbindkeys &#x2013;defaults &gt; $HOME/.xbindkeysrc<br  />
<br  />
"gnome-calculator"<br  />
&#xa0;&#xa0;control+shift + q<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <span class="done DONE">DONE</span> 如何xbindkeys转义命令中的双引号？</h3>
<div class="outline-text-3" id="text-3-6">
<p>
？解决命令中的变量替换问题。"n=1; wmctrl -l | sed -En "${n}p" | awk "{print $1}" | xargs -i wmctrl -ia {}"
</p>

<p class="verse">
<a href="https://www.google.com/search?q=xbindkeys+quote+escape">https://www.google.com/search?q=xbindkeys+quote+escape</a><br  />
<a href="https://superuser.com/questions/400665/xbindkeys-escape-quotes">https://superuser.com/questions/400665/xbindkeys-escape-quotes</a><br  />
Technically what's happening is that xbindkeys removes the outermost pair of double quotes, then runs the remaining string using sh -c.<br  />
</p>
</div>
</div>
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> <span class="done DONE">DONE</span> 如何wmctrl使用16进制窗口id激活进程？</h3>
<div class="outline-text-3" id="text-3-7">
<p>
？id精确激活进程。
</p>

<p class="verse">
man wmctrl<br  />
-i     Interpret window arguments (&lt;WIN&gt;) as a numeric value rather  than  a<br  />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;string  name  for  the  window.  If the numeric value starts with the<br  />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;prefix '0x' it is assumed to be a hexadecimal number.<br  />
<br  />
wmctrl -ia $win<sub>id</sub><br  />
</p>
</div>
</div>
<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 如何wmctrl -l不列出没有窗口的信息？</h3>
<div class="outline-text-3" id="text-3-8">
<p>
？解决幽灵窗口，例如virtualbox关掉管理窗口还是有管理窗口的信息。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yjr</p>
<p class="date">Created: 2017-08-10 Thu 20:25</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
